# 210449787_SIrvine_CSC8101_Neo4j

## **Task details**

There are four tasks:

1. Find isolated nodes
2. Compute the community cluster of each node
3. Compute the centrality score of each node
4. Find the top centrality zones within each community

In task 0 you will develop a cypher query to find nodes and relationship of a certain type.

In tasks 1 and 2 you will execute two different algorithms available in the [Neo4j Data Science Library (GDS)](https://neo4j.com/docs/graph-data-science/current/algorithms/). Both tasks follow the typical workflow described [here](https://neo4j.com/docs/graph-data-science/current/common-usage/):

- Create an (in-memory) [graph projection](https://neo4j.com/docs/graph-data-science/current/common-usage/creating-graphs/).
- Estimate the memory necessary to run the algorithm (optional).
- Run the algorithm in [stats mode](https://neo4j.com/docs/graph-data-science/current/common-usage/running-algos/#running-algos-stats) to summarise the output of the algorithm.
- Run the algorithm in [stream mode](https://neo4j.com/docs/graph-data-science/current/common-usage/running-algos/#running-algos-stream) to run the algorithm but not store the results in the original graph.

In task 3 you will develop a cypher query that combines the outcomes of tasks 1 and 2.

---

### **Task 0 - Find isolated nodes**

Find all:

1. Self-pointing relationships, that is, all relationship instances of type `:CONNECTS` where the start node is the same as the end node.
2. Find all isolated nodes, i.e. all nodes that have no relationship instances of type `:CONNECTS` to other nodes except possibly to themselves.

> Important: Do not delete the nodes/relationships found this way. Execute MATCH only queries.
> 

### Results

1. Self-pointing relationships:
**MATCH (z1:zone)-[rel:CONNECTS]->(z2:zone) WHERE [z1.id=z2.id](http://z1.id%3Dz2.id/) RETURN count(rel)**
Result: 248 nodes
2. All isolated nodes:
**MATCH (z:zone) WHERE NOT (z)-[:CONNECTS]-(:zone) RETURN z**
Result: 3 nodes
    
    ```
    ╒═════════════════════════════════════════════════════════════════╕
    │"z"                                                              │
    ╞═════════════════════════════════════════════════════════════════╡
    │{"name":"Governor's Island/Ellis Island/Liberty Island","id":103}│
    ├─────────────────────────────────────────────────────────────────┤
    │{"name":"Governor's Island/Ellis Island/Liberty Island","id":104}│
    ├─────────────────────────────────────────────────────────────────┤
    │{"name":"Great Kills Park","id":110}                             │
    └─────────────────────────────────────────────────────────────────┘
    ```
    
    ![Exported nodes from Neo4j - all isolated nodes within network](210449787_%2028eb9/graph.svg)
    
    Exported nodes from Neo4j - all isolated nodes within network
    

**Comments:** We want to remove these isolated nodes from the network as they would be included for community detection - identifying them as a cluster.

---

### **Task 1 - Community detection**

Run the Louvain algorithm for community detection, available in the [GDS library](https://neo4j.com/docs/graph-data-science/current/algorithms/louvain/), with the following arguments:

- Graph projection of type `UNDIRECTED`.
- Name the graph projection as `USERNAME-communities` where USERNAME is your username (this is necessary to avoid naming conflicts between students).
- Weighted by the `trips` property in `:CONNECTS` type of relationships.

As specified above, run the algorithm in 2 modes: `stats` and `stream`:

- Report the number of communities using the `stats` mode,
- Export the results of running the algorithm in `stream` as a CSV file with two columns `zone_id` and `community_id` and
- Visualise the results in the [app](http://csc8101-neo4j-shiny.uksouth.cloudapp.azure.com/) by uploading the produced csv file (right-click to download image).

> Tip: See the examples page.
> 
> 
> **Important:** Do not run the algorithm in `merge` mode.
> 
> **Note:** Isolated nodes have been removed for this task (reflecting the results of task 0).
> 

### Results

1. **Create graph projection:** 
    
    //Task 1 - Create graph projection
    CALL gds.graph.create( 'c210449787-communities', 'zone', { CONNECTS: {orientation: 'UNDIRECTED'} }, { relationshipProperties: 'trips'} )
    
    ```markdown
    ├──────────────────────────────────────────────────────────────────────┼───────────────────────────────────────┼──────────┼─────────────┼─────────────┼───────────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────────┼───────────────────┼───────────┼───────────────────┼────────────┼────────────────────┼──────────────────┼────────────────────────────────────────┼────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┤
    │{"p99":193,"min":1,"max":203,"mean":91.56756756756756,"p90":178,"p50":│"c210449787-communities"               │"neo4j"   │"2345 KiB"   │2401606      │{"zone":{"label":"zone","properties":{}}}      │{"CONNECTS":{"orientation":"UNDIRECTED","aggregation":"DEFAULT","type"│null       │null               │259        │23716              │null        │null                │0.3549130525874712│"2022-02-26T16:25:41.750907000[Etc/UTC]"│"2022-02-26T16:25:41.760777000[Etc/UTC]"│{"relationships":{"CONNECTS":{"trips":"Float (DefaultValue(NaN), PERSI│
    │82,"p999":203,"p95":186,"p75":148}                                    │                                       │          │             │             │                                               │:"CONNECTS","properties":{"trips":{"defaultValue":null,"property":"tri│           │                   │           │                   │            │                    │                  │                                        │                                        │STENT, Aggregation.DEFAULT)"}},"nodes":{"zone":{}}}                   │
    │                                                                      │                                       │          │             │             │                                               │ps","aggregation":"DEFAULT"}}}}                                       │           │                   │           │                   │            │                    │                  │                                        │                                        │                                                                      │
    ├──────────────────────────────────────────────────────────────────────┼───────────────────────────────────────┼──────────┼─────────────┼─────────────┼───────────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────────┼───────────────────┼───────────┼───────────────────┼────────────┼────────────────────┼──────────────────┼────────────────────────────────────────┼────────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┤
    ```
    
2. **Memory estimator:**
    
    //Task 1 - Memory estimator
    CALL gds.louvain.write.estimate('c210449787-communities', {writeProperty: 'community'})
    YIELD nodeCount, relationshipCount, bytesMin, bytesMax, requiredMemory
    
    ```
    ╒═══════════╤═══════════════════╤══════════╤══════════╤══════════════════════╕
    │"nodeCount"│"relationshipCount"│"bytesMin"│"bytesMax"│"requiredMemory"      │
    ╞═══════════╪═══════════════════╪══════════╪══════════╪══════════════════════╡
    │259        │23716              │21921     │887080    │"[21 KiB ... 866 KiB]"│
    └───────────┴───────────────────┴──────────┴──────────┴──────────────────────┘
    ```
    
3. **Run in Stream mode:** 
    
    //Task 1 - Run Louvain in stream mode
    CALL gds.louvain.stream('c210449787-communities')
    YIELD nodeId, communityId
    RETURN gds.util.asNode(nodeId).id AS zone_id, communityId as community
    ORDER BY community ASC
    
    [c210449787-communities-stream.csv](210449787_%2028eb9/c210449787-communities-stream.csv)
    
4. **Run in Stats mode:**
    
    //Task 1 - Run Louvain in stats mode
    CALL gds.louvain.stats('c210449787-communities')
    YIELD communityCount
    
    ```
    ╒════════════════╕
    │"communityCount"│
    ╞════════════════╡
    │5               │
    └────────────────┘
    ```
    
5. **Visualize the results in the app:**
    
    ![**Task 1 - Communities identified**](210449787_%2028eb9/Untitled.png)
    
    **Task 1 - Communities identified**
    
    ![**New York Boroughs**](210449787_%2028eb9/Untitled%201.png)
    
    **New York Boroughs**
    

**Comments:** There are 5 communities identified with Louvain method. As can be seen, we have confidence that the communities are correct as they largely overlap with the borough structure, with differences being between at zones where there are river/bridge crossings.

---

### **Task 2 - Centrality analysis**

Run the Page Rank algorithm for centrality analysis, available in the [GDS library](https://neo4j.com/docs/graph-data-science/current/algorithms/page-rank), with the following arguments:

- Directed graph projection
- Name the graph projection as `USERNAME-centrality` where USERNAME is your username (this is necessary to avoid naming conflicts between students).
- Damping factor: 0.75
- Weighted by the `trips` property in `:CONNECTS` type of relationships.

As specificed above, run the algorithm in 2 modes: `stats` and `stream`:

- Report the maximum and minimum centrality score using the `stats` mode,
- Export the results of running the algorithm in `stream` as a CSV file with two columns `zone_id` and `centrality_score` and
- Visualise the results in the [app](http://csc8101-neo4j-shiny.uksouth.cloudapp.azure.com/) by uploading the produced csv file (right-click to download image).

> Tip: See the examples page.
> 
> 
> **Important:** Do not run the algorithm in `merge` mode.
> 
> **Note:** Isolated nodes have been removed for this task (reflecting the results of task 0).
> 

### Results

1. **Create graph projection:** 
    
    //Task 2 - Create graph projection
    CALL gds.graph.create(
    'c210449787-centrality',
    'zone',
    'CONNECTS',
    {
    relationshipProperties: 'trips'
    }
    )
    
    ```markdown
    ╒═════════════════════════════════════════╤══════════════════════════════════════════════════════════════════════╤═════════════════════╤═══════════╤═══════════════════╤══════════════╕
    │"nodeProjection"                         │"relationshipProjection"                                              │"graphName"          │"nodeCount"│"relationshipCount"│"createMillis"│
    ╞═════════════════════════════════════════╪══════════════════════════════════════════════════════════════════════╪═════════════════════╪═══════════╪═══════════════════╪══════════════╡
    │{"zone":{"label":"zone","properties":{}}}│{"CONNECTS":{"orientation":"NATURAL","aggregation":"DEFAULT","type":"C│"c210449787-pagerank"│259        │11858              │7             │
    │                                         │ONNECTS","properties":{"trips":{"defaultValue":null,"property":"trips"│                     │           │                   │              │
    │                                         │,"aggregation":"DEFAULT"}}}}                                          │                     │           │                   │              │
    └─────────────────────────────────────────┴──────────────────────────────────────────────────────────────────────┴─────────────────────┴───────────┴───────────────────┴──────────────┘
    ```
    
2. **Run in Stats mode:** 
    
    //Task 2 - Run pageRank in stats mode
    CALL gds.pageRank.stats('c210449787-centrality', {
    maxIterations: 20,
    dampingFactor: 0.75
    })
    YIELD centralityDistribution
    RETURN centralityDistribution.max AS max, centralityDistribution.min AS min
    
    ```
    ╒══════════════════╤═════╕
    │"max"             │"min"│
    ╞══════════════════╪═════╡
    │1.6610088348388672│0.25 │
    └──────────────────┴─────┘
    ```
    
3. **Run in Stream mode:**
    
    //Task 2 - Run pageRank in stream mode
    CALL gds.pageRank.stream('c210449787-centrality', {
    maxIterations: 20,
    dampingFactor: 0.75
    })
    YIELD nodeId, score
    RETURN gds.util.asNode(nodeId).id AS zone_id, score
    ORDER BY zone_id ASC
    
    [c210449787-centrality-stream.csv](210449787_%2028eb9/c210449787-centrality-stream.csv)
    
4. **Visualize the results in the app:**
    
    ![**Task 2 - Centrality (Page Rank) Scores**](210449787_%2028eb9/Untitled%202.png)
    
    **Task 2 - Centrality (Page Rank) Scores**
    
    ![**New York Boroughs**](210449787_%2028eb9/Untitled%201.png)
    
    **New York Boroughs**
    

**Comments:** The lighter colour areas represent higher centrality within the zones. The next stage is to combine this information with the communities found from Task 1 so we can recommend zones within a community - so a taxi company can focus on these ‘hubs’.

---

### **Task 3 - Zone recommendation**

Find the top 3 highest centrality zones per each community:

1. Including zones in the 'Manhattan' borough.
2. Excluding zones in the 'Manhattan' borough.

Do this using the available zone labels `community` (representing the community id obtained in 1) and `centrality` (representing the centrality score obtained in 2).

For each case, return two columns: `zone_id` and `community_id` and export the query results to a csv file. Then, using the visualisation [app](http://csc8101-neo4j-shiny.uksouth.cloudapp.azure.com/), upload these (one at a time) to the 'Task-3' file input and produce a separate and produce two separate images.

> Important: Do not delete any nodes/relationships. Execute MATCH queries only.
> 
> 
> **Note:** Zone nodes now have two new properties - 'centrality' and 'community' (reflecting the result of tasks 1 and 2).
> 

### Results

1. **Top 3 highest centrality zones per each community (incl. Manhattan borough)**
    
    //Task 3 - Top 3 highest centrality zones per each community (incl. Manhattan borough)
    MATCH (n:zone)
    WITH n
    ORDER BY n.centrality DESC
    WITH n.community as community, COLLECT([n.id](http://n.id/))[..3] as top_three
    UNWIND top_three as zone_id
    RETURN zone_id, community
    
    ```
    ╒═════════╤═══════════╕
    │"zone_id"│"community"│
    ╞═════════╪═══════════╡
    │236      │232        │
    ├─────────┼───────────┤
    │237      │232        │
    ├─────────┼───────────┤
    │141      │232        │
    ├─────────┼───────────┤
    │130      │127        │
    ├─────────┼───────────┤
    │82       │127        │
    ├─────────┼───────────┤
    │95       │127        │
    ├─────────┼───────────┤
    │238      │234        │
    ├─────────┼───────────┤
    │239      │234        │
    ├─────────┼───────────┤
    │142      │234        │
    ├─────────┼───────────┤
    │170      │78         │
    ├─────────┼───────────┤
    │161      │78         │
    ├─────────┼───────────┤
    │79       │78         │
    ├─────────┼───────────┤
    │61       │95         │
    ├─────────┼───────────┤
    │181      │95         │
    ├─────────┼───────────┤
    │251      │95         │
    └─────────┴───────────┘
    ```
    
    [c210449787-zone_recommendation-incl_Manhattan.csv](210449787_%2028eb9/c210449787-zone_recommendation-incl_Manhattan.csv)
    
    ![**Top 3 highest centrality zones per each community (incl. Manhattan borough)**](210449787_%2028eb9/Untitled%203.png)
    
    **Top 3 highest centrality zones per each community (incl. Manhattan borough)**
    
    ![**Comparing against communities identified in Task 1**](210449787_%2028eb9/Untitled.png)
    
    **Comparing against communities identified in Task 1**
    
2. **Top 3 highest centrality zones per each community (excl. Manhattan borough)**
    
    //Task 3 - Top 3 highest centrality zones per each community (excl. Manhattan borough)
    MATCH (n:zone)-[:IN]->(b:borough)
    WHERE [b.name](http://b.name/) <> "Manhattan"
    WITH n
    ORDER BY n.centrality DESC
    WITH n.community as community, COLLECT([n.id](http://n.id/))[..3] as top_three
    UNWIND top_three as zone_id
    RETURN zone_id, community
    
    ```
    ╒═════════╤═══════════╕
    │"zone_id"│"community"│
    ╞═════════╪═══════════╡
    │130      │127        │
    ├─────────┼───────────┤
    │82       │127        │
    ├─────────┼───────────┤
    │95       │127        │
    ├─────────┼───────────┤
    │61       │95         │
    ├─────────┼───────────┤
    │181      │95         │
    ├─────────┼───────────┤
    │251      │95         │
    ├─────────┼───────────┤
    │213      │234        │
    ├─────────┼───────────┤
    │69       │234        │
    ├─────────┼───────────┤
    │242      │234        │
    ├─────────┼───────────┤
    │168      │232        │
    ├─────────┼───────────┤
    │256      │78         │
    ├─────────┼───────────┤
    │255      │78         │
    ├─────────┼───────────┤
    │112      │78         │
    └─────────┴───────────┘
    ```
    
    [c210449787-zone_recommendation-excl_Manhattan.csv](210449787_%2028eb9/c210449787-zone_recommendation-excl_Manhattan.csv)
    
    ![**Top 3 highest centrality zones per each community (excl. Manhattan borough)**](210449787_%2028eb9/Untitled%204.png)
    
    **Top 3 highest centrality zones per each community (excl. Manhattan borough)**
    
    ![**New York Boroughs**](210449787_%2028eb9/Untitled%201.png)
    
    **New York Boroughs**
    

**Comments:** The communities generated in Task 1 largely matched boroughs but for recommendation based on centrality there appears to be an issue where top 3 zones are spread across different communities (note, Staten Island and Brooklyn - partially treated as one community).

---

### Discussion

How can GDSL algorithms be used to generate useful insights into the NYC trips graph? 

Use the solutions to the Neo4J exercise to test other centrality and community algorithms, and briefly discuss their relative merits. 

> Imagine you have been asked to select an analytics strategy to recommend taxi positioning to a client, and you are now discussing your solution with your manager
> 

### Results

1. **COMMUNITY: Comparing Louvain to Label Propagation**
    
    // Run Label Propagation in Stream Mode
    CALL gds.labelPropagation.stream('c210449787-communities')
    YIELD nodeId, communityId
    RETURN gds.util.asNode(nodeId).id AS zone_id, communityId as community
    ORDER BY community ASC
    
    [c210449787-labelprop-stream.csv](210449787_%2028eb9/c210449787-labelprop-stream.csv)
    
    ![**Communities generated based on Label Propagation**](210449787_%2028eb9/Untitled%205.png)
    
    **Communities generated based on Label Propagation**
    
    ![**Communities generated based on Louvain**](210449787_%2028eb9/Untitled.png)
    
    **Communities generated based on Louvain**
    
    **Comments:** Label Propagation is able to handle overlapping communities but penalizes zones where there is no relationship. This creates crude communities. Louvain is better here.
    
2. **COMMUNITY: Comparing Louvain to Modularity Optimization**
    
    // Modularity Optimization Community Detection Stream
    CALL gds.beta.modularityOptimization.stream('c210449787-communities')
    YIELD nodeId, communityId
    RETURN gds.util.asNode(nodeId).id AS zone_id, communityId
    
    [c210449787-mod_opt-stream.csv](210449787_%2028eb9/c210449787-mod_opt-stream.csv)
    
    ![**Communities generated based on Modularity Optimization**](210449787_%2028eb9/Untitled%206.png)
    
    **Communities generated based on Modularity Optimization**
    
    ![**Communities generated based on Louvain**](210449787_%2028eb9/Untitled.png)
    
    **Communities generated based on Louvain**
    
    **Comments:** Louvain is a modularity optimization algorithm so it is not surprising to see similar results. The Modularity Optimization algorithm used within Neo4j is more refined than Louvain (and less than *Fast Greedy*) and seeks weights within relationships.
    
3. **CENTRALITY: Comparing Page Rank to Harmonic**
    
    // Harmonic Centrality Stream
    CALL gds.alpha.closeness.harmonic.stream('c210449787-centrality')
    YIELD nodeId, centrality
    RETURN gds.util.asNode(nodeId).id AS zone_id, centrality as score
    ORDER BY zone_id ASC
    
    [c210449787-harmonic-stream.csv](210449787_%2028eb9/c210449787-harmonic-stream.csv)
    
    ![**Centrality calculated by Harmonic algorithm**](210449787_%2028eb9/Untitled%207.png)
    
    **Centrality calculated by Harmonic algorithm**
    
    ![**Comparing Page Rank Centrality**](210449787_%2028eb9/Untitled%202.png)
    
    **Comparing Page Rank Centrality**
    
    **Comments:** Harmonic centrality is a variant of closeness centrality but deals with unconnected graphs. In my opinion it produces less favourable results for this task as it generalizes larger areas and excludes Staten island.
    

---